// Generated by Damned Memory Traversal Tool
// Base: 0x400000 Offsets: [[base]+0x0017E0A8]+0x0
// Base offset from module: 0x0

#pragma once
#include <cstdint>
#include <vector>
#include <Windows.h>

constexpr uintptr_t BASE_OFFSET = 0x0;

// Struct layout (use with direct memory access)
struct GameStruct {
    char _pad0[0xEC];
    int32_t health; // 0xEC
    int32_t armor; // 0xF0
    char _pad1[0x14];
    int32_t pistal_mag; // 0x108
    char _pad2[0x10];
    int32_t rifle_mag; // 0x11C
    char _pad3[0xC];
    int32_t pistal_ammo; // 0x12C
    char _pad4[0x10];
    int32_t rifle_ammo; // 0x140
    int32_t bomb; // 0x144
    char _pad5[0x20];
    int32_t rapid_bomb; // 0x168
};

// Pointer chain helper (use with ReadProcessMemory/WriteProcessMemory)
class GameStructReader {
    HANDLE hProcess;
    uintptr_t moduleBase;
    
    template<typename T>
    T Read(uintptr_t addr) {
        T val{};
        ReadProcessMemory(hProcess, (LPCVOID)addr, &val, sizeof(T), nullptr);
        return val;
    }
    
    template<typename T>
    bool Write(uintptr_t addr, T val) {
        return WriteProcessMemory(hProcess, (LPVOID)addr, &val, sizeof(T), nullptr);
    }
    
    // FollowChain: add offset, then read pointer (except for last offset)
    uintptr_t FollowChain(uintptr_t base, std::vector<int64_t> offsets) {
        uintptr_t addr = base;
        for (size_t i = 0; i < offsets.size(); i++) {
            addr = addr + offsets[i];
            if (i < offsets.size() - 1) {
                addr = Read<uintptr_t>(addr);
                if (addr == 0) return 0;
            }
        }
        return addr;
    }
    
public:
    GameStructReader(HANDLE process, uintptr_t base) : hProcess(process), moduleBase(base) {}
    
    int32_t getHealth() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0xEC}));
    }
    bool setHealth(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0xEC}), val);
    }
    
    int32_t getArmor() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0xF0}));
    }
    bool setArmor(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0xF0}), val);
    }
    
    int32_t getPistal_mag() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x108}));
    }
    bool setPistal_mag(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x108}), val);
    }
    
    int32_t getRifle_mag() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x11C}));
    }
    bool setRifle_mag(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x11C}), val);
    }
    
    int32_t getPistal_ammo() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x12C}));
    }
    bool setPistal_ammo(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x12C}), val);
    }
    
    int32_t getRifle_ammo() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x140}));
    }
    bool setRifle_ammo(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x140}), val);
    }
    
    int32_t getBomb() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x144}));
    }
    bool setBomb(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x144}), val);
    }
    
    int32_t getRapid_bomb() {
        return Read<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x168}));
    }
    bool setRapid_bomb(int32_t val) {
        return Write<int32_t>(FollowChain(moduleBase + BASE_OFFSET, {0x17E0A8, 0x168}), val);
    }
    
};
